{"__type__":"cc.TextAsset","_name":"DemoList","text":"LICENSE AGREEMENT\n\n4. 期限及终止\n4.1 本授权协议的期限将持续至用户或厦门雅基根据下述约定终止协议。\n4.2 若用户想终止本授权协议，用户可以通过停止使用 Cocos Creator 产品实现。\n4.3 在下列情形下，厦门雅基可以在任何时间终止本授权协议：\n4.3.1 用户违反本授权协议的任何条款；\n4.3.2 厦门雅基按照法律法规的相关规定终止本授权协议；\n4.3.3 与厦门雅基一同向用户提供 Cocos Creator 产品某部分的任何合伙人终止其与厦门雅基的合作关系或者停止向用户提供 Cocos Creator 产品某部分；\n4.3.4 厦门雅基决定不再向用户居民身份所属国家或用户使用 Cocos Creator 产品所在国家之用户提供 Cocos Creator 产品或 Cocos Creator 产品某部分；\n4.3.5 厦门雅基向用户提供的 Cocos Creator 产品不具备商业可行性；\n4.3.6 厦门雅基有权自主决定随时终止本授权协议。\n4.4 本授权协议因任何原因终止后，根据本授权协议授予用户的所有权利立即终止，终止后用户应当停止使用 Cocos Creator 产品。\n\n附件一：\n\nSpine Runtimes Software License\nVersion 2\nCopyright (c) 2013, Esoteric Software\nAll rights reserved.\nYou are granted a perpetual, non-exclusive, non-sublicensable and non-transferable license\nto install, execute  and perform the Spine  Runtimes Software (the  \"Software\") solely for internal use.  Without the  written  permission of  Esoteric  Software,  you may  not  (a)  modify, translate, adapt  or  otherwise  create  derivative  works,  improvements  of  the  Software  or develop  new applications using  the Software  or  (b) remove,  delete, alter  or obscure  any trademarks  or any copyright, trademark, patent  or other intellectual property  or proprietary rights notices  on or in the Software,  including any copy thereof.  Redistributions in binary or source form must include this license and terms\nTHIS  SOFTWARE  IS  PROVIDED   BY  ESOTERIC  SOFTWARE  \"AS  IS\"  AND   ANY  EXPRESS  OR IMPLIED  WARRANTIES,   INCLUDING,   BUT  NOT   LIMITED  TO,   THE  IMPLIED   WARRANTIES  OFMERCHANTABILITY AND  FITNESS FOR  A PARTICULAR  PURPOSE ARE  DISCLAIMED. IN  NO EVENTSHALL   ESOTERIC   SOFTARE  BE   LIABLE   FOR   ANY   DIRECT,   INDIRECT,   INCIDENTAL,  SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED  TO, PROCUREMENT OF   SUBSTITUTE   GOODS  OR   SERVICES;   LOSS   OF   USE,   DATA,   OR  PROFITS;   OR   BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT,STRICT LIABILITY, OR TORT  (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN  ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.\n\n\n\n\n"}