{"__type__":"cc.TextAsset","_name":"dash-line","text":"\n授权协议\n\n本授权协议中 “Cocos Creator” 是指由厦门雅基软件有限公司开发的可以跨平台运行的桌面应用程序软件，可用于开发制作在 Android、iOS、Web Standard、Windows、Mac 等平台运行的游戏软件和多媒体交互程序。Cocos Creator 软件包括开源的 JavaScript 引擎和编辑器扩展，以及开源的 C++ 引擎部分，和非开源的编辑器程序。\n\n开源的 JavaScript 和 C++ 引擎以及开源编辑器扩展可以由开发者用户自由定制并用于面向最终用户的游戏和多媒体交互软件的开发，但不能用于同类产品（游戏开发工具）的制作和再次发行。\n\n根据本授权协议条款授权用户使用 Cocos Creator 产品。本授权协议构成用户与厦门雅基软件有限公司（“厦门雅基”是一家中国厦门公司，地址位于中国厦门市思明区塔埔东路 167 号 1301 室，邮编 361008）之间就用户使用 Cocos Creator 产品而订立的合法有效之协议。为使用 Cocos Creator产品，用户必须同意并接受本协议，用户下载、安装、复制或以其他途径使用 Cocos Creator 产品，均构成对本协议条款的认可和接受。如果用户不接受本协议，用户将被禁止使用 Cocos Creator 产品，即无权进行下载、复制、安装或其他使用 Cocos Creator 产品或任何相关部分的操作。\n\n1. 授权授予与接受\n1.1 通过下载、安装、复制或以其他方式使用 Cocos Creator 产品的，表示用户据此不作修订地接受本授权协议下所有条款和条件。如果用户为用户雇主或其他实体之利益下载、安装、复制或以其他方式使用 Cocos Creator 产品，用户据此同意用户代表用户雇主或其他实体订立本授权协议，用户声明且保证用户有完整合法的权利使用户雇主或相关实体受本授权协议之约束。如果用户没有上述完整合法之权利，用户不得接受本授权协议且不得为用户雇主或其他实体之利益使用 Cocos Creator 产品。\n1.2 根据本授权协议之条款，厦门雅基授予用户有限的、全球范围内的、免版税的、不可转让的、可撤销的、非排他性授权，用户可使用 Cocos Creator 产品在用户目标平台上独自开发应用和游戏。本授权协议约定的软件或工具仅被授权使用，绝非出售。\n1.3 用户不得超出本授权协议的授权范围使用 Cocos Creator 产品。包括但不限于用户不得：\n（1）复制（备份目的除外）、改变、修改、二次散布、反编译、逆向工程、拆分或创作Cocos Creator 产品任何部分的衍生产品；（2）用其他软件组合 Cocos Creator 产品的任何部分；（3）创建 Cocos Creator 产品的“代码分支”或者其他衍生产品，或散布、参与创作或以任何途径推销 Cocos Creator 产品的任何衍生产品。（4）将 Cocos Creator 产品作为任何开发工具箱或程序库、应用程序生成器、网站生成器之部分，或任何为软件、应用或网站的开发者或设计者所用的软件或工具之部分进行二次散布。\n1.4 用户同意仅在（1）本授权协议以及（2）任何适用的法律、法规或相关司法管辖区普遍认同的实践和指南允许的前提下使用 Cocos Creator 产品和编写应用程序。\n1.5 用户同意对其创作、传播或通过 Cocos Creator 产品展示的任何数据、内容或资源，以及用户行为之后果（包括厦门雅基可能遭受的任何损失或损害）独自承担责任（厦门雅基对用户或任何第三方不承担责任）。\n1.6 用户对违反任何适用的法律法规、本授权协议项下的义务、任何适用的第三方合同或服务条款，以及用户对上述违反行为造成的后果（包括厦门雅基或任何第三方可能遭受的任何损失或损害）独自承担责任（厦门雅基对用户或任何第三方不承担责任）。\n1.7 若用户被用户居民身份所属国家或用户使用 Cocos Creator 产品所在国家之法律禁止接收 Cocos Creator 产品，用户则不得使用 Cocos Creator 产品且不得接受本授权协议。\n\n\n\n附件一：\n\nSpine Runtimes Software License\nVersion 2\nCopyright (c) 2013, Esoteric Software\nAll rights reserved.\nYou are granted a perpetual, non-exclusive, non-sublicensable and non-transferable license\nto install, execute  and perform the Spine  Runtimes Software (the  \"Software\") solely for internal use.  Without the  written  permission of  Esoteric  Software,  you may  not  (a)  modify, translate, adapt  or  otherwise  create  derivative  works,  improvements  of  the  Software  or develop  new applications using  the Software  or  (b) remove,  delete, alter  or obscure  any trademarks  or any copyright, trademark, patent  or other intellectual property  or proprietary rights notices  on or in the Software,  including any copy thereof.  Redistributions in binary or source form must include this license and terms\nTHIS  SOFTWARE  IS  PROVIDED   BY  ESOTERIC  SOFTWARE  \"AS  IS\"  AND   ANY  EXPRESS  OR IMPLIED  WARRANTIES,   INCLUDING,   BUT  NOT   LIMITED  TO,   THE  IMPLIED   WARRANTIES  OFMERCHANTABILITY AND  FITNESS FOR  A PARTICULAR  PURPOSE ARE  DISCLAIMED. IN  NO EVENTSHALL   ESOTERIC   SOFTARE  BE   LIABLE   FOR   ANY   DIRECT,   INDIRECT,   INCIDENTAL,  SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED  TO, PROCUREMENT OF   SUBSTITUTE   GOODS  OR   SERVICES;   LOSS   OF   USE,   DATA,   OR  PROFITS;   OR   BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT,STRICT LIABILITY, OR TORT  (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN  ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.\n\n\n\n\n"}